{
  "termsAndConditions": [
    {
      "titleDescription": "Website Terms and Conditions"
    },
    {
      "title": "Definitions",
      "description": "User of the website (hereinafter referred to as the User) – a person who has access to the Website via the Internet and uses the Website. Website Administration (hereinafter referred to as the Website Administration) – authorized employees responsible for managing the Website, organizing and/or processing personal data, defining the purposes of personal data processing, determining the composition of personal data to be processed, and carrying out actions (operations) with personal data."
    },
    {
      "title": "General Provisions",
      "description": "These Terms and Conditions of Website Use (hereinafter referred to as the Terms) constitute a public agreement between the owner of the company in the form of a limited liability company and each registered user of our service. By using our website, you understand and agree to these Terms and Conditions of Website Use as a whole, as well as the rules and conditions outlined in each section. Please do not use the website if you do not agree with these Terms."
    },
    {
      "title": "Rules",
      "description": "The information posted on the website may only be used in compliance with all the requirements stated herein. Therefore, please carefully read these terms of use (hereinafter referred to as the Rules). Each Party guarantees the other Party that it possesses the necessary legal and operational capacity."
    },
    {
      "title": "Intellectual Property",
      "description": "All textual information and graphic images contained on this website are the property of the Seller and its counterparties. The names of trademarks, trade names, and logos displayed on the website are the property of their respective owners. The User may view and download materials from this website solely for personal, non-commercial use, provided that all copyright information and other ownership notices contained in the original materials and any copies thereof are preserved. It is prohibited to modify the materials of this Website, distribute, or display them in any form, or use them in any other way for public or commercial purposes. Any use of these materials on other websites or in computer networks is prohibited."
    },
    {
      "title": "Links to Other Websites",
      "description": "Links to other resources (websites) found on this website are provided solely for informational purposes. The Website Administration bears no responsibility for any damages or losses incurred as a result of navigating to websites whose links are found on this website."
    },
    {
      "title": "Modifications",
      "description": "The Website Administration reserves the right, at its sole discretion, to modify, amend, supplement, or delete any sections of this Agreement at any time, either in full or in part. Changes made to the Agreement will become effective once a notice about these changes is posted on the Website. Your continued use of the Website after the notice of modifications to the Agreement is posted signifies your acceptance of these changes. The Website Administration may, at any time, without prior notice, cancel, modify, or correct any errors or omissions in any section of the website, as well as make other changes to the website materials and post information about products or prices (if applicable), suspend or terminate the operation of various sections of the website, including access to certain features of the website. The Website Administration may also impose restrictions on certain features and services or limit your access to certain sections of the website or the entire website without notice and without liability."
    },
    {
      "title": "Security",
      "description": "You must not: Use any devices or software that may interfere with the operation of the Website; Take any actions that result in disproportionately large and unreasonable loads on the Website's infrastructure (e.g., mass email distribution – 'spam'); Interfere with the website’s software or functional elements, including placing materials on the Website that are infected with viruses, malware such as 'Trojan horses,' 'time bombs,' or other elements that may harm the software structure of the website or affect its operation."
    },
    {
      "title": "Notifications",
      "description": "All references to \"letters,\" \"messages,\" and similar expressions relate to electronic communication methods (e.g., via email), provided that the sending party retains verifiable evidence that the message was sent and received."
    },
    {
      "title": "Limitation of Liability",
      "description": "Under no circumstances shall the Website Administration be liable for any direct, indirect, incidental, consequential, or punitive damages (including, without limitation, damages resulting from loss of business, failure to enter into a contract, loss of revenue, data, information, or business interruptions) arising out of or in connection with the use or inability to use this website or its content."
    },
    {
      "title": "Dispute Resolution",
      "description": "A User who believes that their rights and/or interests have been violated by the Website Administration may submit a complaint via email to https://inharmony.com.ua/#/ in Ukrainian or Russian, including their full legal name (for legal entities) or first name, last name, and patronymic (for individuals), as well as a return address (both postal and electronic) and a contact phone number. Within 10 business days after receiving the complaint, the Website Administration is obligated to send a response to the sender’s email address specified in the complaint. The Website Administration does not consider anonymous complaints or complaints that do not contain truthful or complete information about the sender. If the sender is dissatisfied with the response received from the Website Administration or does not receive a response within the specified period, the procedure must be repeated through postal correspondence. For these purposes, the postal address https://inharmony.com.ua/#/ should be used. Additionally, the response period for written correspondence will be extended to 10 business days. If the dispute is not resolved through the complaint submission process, it must be settled in court."
    }
  ]
}
