[
  {
    "name": "Оксана Григоренко",
    "age": 64,
    "message": "Дякую вам за те, що привозите їжу та ліки, коли ніхто більше не приїжджає. Без вас багато хто залишився б без найнеобхіднішого. Бережіть себе!"
  },
  {
    "name": "Сергій Антонюк",
    "age": 32,
    "message": "Не знав, що буває така підтримка, поки не отримав теплий одяг і ліки. Ви реально рятуєте людей. Дякую всій команді!"
  },
  {
    "name": "Людмила Кравець",
    "age": 57,
    "message": "Я думала, що ніхто вже не допоможе, поки не побачила вашу машину з гуманітаркою. Дуже вдячна за їжу, теплі речі і просто за те, що ви не забуваєте про нас."
  },
  {
    "name": "Ігор Мельник",
    "age": 41,
    "message": "Нема слів, щоб висловити вдячність. Їжа, вода, медикаменти — це те, без чого не вижити, і ви нам це привезли. Ви справжні герої!"
  },
  {
    "name": "Ганна Поліщук",
    "age": 70,
    "message": "Ви не просто привезли допомогу, ви привезли надію. Люди, які працюють у вас, роблять справжнє чудо. Хай Бог вас береже!"
  },
  {
    "name": "Віталій Климчук",
    "age": 38,
    "message": "Думав, шо прийдеться мерзнуть цілу зиму, но ви пригнали теплі ковдри й спальники. Краще вас ніхто не шарить, шо треба людям!"
  },
  {
    "name": "Роман Стельмах",
    "age": 29,
    "message": "Я військовий, і знаю, як важливо мати нормальні умови хоча б час від часу. Ваша підтримка — це сила, яка допомагає триматися. Дякую за вашу роботу!"
  },
  {
    "name": "Петро Зайчук",
    "age": 55,
    "message": "Шо тут сказать… Коли нема газу, нема світла, а в хаті мороз, то така допомога, як ваша — це чисте спасіння. Шана вам і повага!"
  },
  {
    "name": "Марина Данилюк",
    "age": 47,
    "message": "Важко бути далеко від дому, але завдяки вам стало трохи легше. Отримала необхідні речі і відчула, що є люди, які піклуються. Дякую вам щиро!"
  },
  {
    "name": "Максим Гречко",
    "age": 26,
    "message": "Шо я можу сказать? Ви круті. Привезли нам все, шо треба, а ще головне — ви показуєте, шо людям не все одно. Дякую від душі!"
  }
]
