import { Container } from '@/shared/components';
import s from './TermsAndConditionsPage.module.scss';

const TermsAndConditionsPage = () => {
  return (
    <section className={s.section}>
      <Container>
        <h1 className={s.title}>Правила та умови сайту</h1>
        <ul className={s.list}>
          <li className={s.item}>
            <h2 className={s.subTitle}>Визначення</h2>
            <p className={s.text}>
              Користувач сайту (далі Користувач) – особа, яка має доступ до
              Сайту, за допомогою мережі Інтернет і використовує Сайт.
              Адміністрація сайту (далі адміністрація сайту) – уповноважені
              співробітники управління сайтом, які організовують і (або)
              здійснюють обробку персональних даних, а також визначають цілі
              обробки персональних даних, склад персональних даних, що
              підлягають обробці, дії (операції), здійснюються з персональними
              даними.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Загальні положення</h2>
            <p className={s.text}>
              Ці Правила та умови користування сайтом (далі, Правила) є
              публічним договором між власником компанії у формі товариства з
              обмеженою відповідальністю і кожним зареєстрованим користувачем
              нашого сервісу. Використовуючи наш сайт, Ви розумієте і
              погоджуєтеся з цими Правилами та умовами користування сайтом в
              цілому, а також з правилами і умовами, викладеними в кожному
              розділі. Будь ласка, не використовуйте сайт, якщо Ви не згодні з
              цими Правилами.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Правила</h2>
            <p className={s.text}>
              Інформація, розміщена на сайті, може використовуватися тільки за
              умови дотримання всіх вимог, тому просимо уважно прочитати правила
              користування (далі – Правила / Правилами). Кожна Сторона гарантує
              іншій Стороні, що володіє необхідною право- і дієздатністю.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Інтелектуальна власність</h2>
            <p className={s.text}>
              Вся текстова інформація та графічні зображення, які містить цей
              сайт, є власністю Продавця і його контрагентів. Назви торгових
              марок, товарних знаків і логотипи, розміщені на сайті, є власністю
              їх власників. Користувач може переглядати і завантажувати
              матеріали цього сайту тільки для особистого некомерційного
              використання, за умови збереження всієї інформації про авторське
              право та інших відомостей про право власності, що містяться у
              вихідних матеріалах і будь-яких їхніх копіях. Забороняється
              змінювати матеріали цього Сайту, а також поширювати або
              демонструвати їх в будь-якому вигляді або використовувати їх
              будь-яким іншим чином для суспільних або комерційних цілей.
              Будь-яке використання цих матеріалів на інших сайтах або в
              комп’ютерних мережах забороняється.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Посилання на інші сайти</h2>
            <p className={s.text}>
              Посилання на інші ресурси (сайти), які знаходяться на цьому сайті,
              призначені виключно для ознайомлювальних цілей. Адміністрація
              сайту не несе ніякої відповідальності за будь-які збитки або
              втрати, які можуть бути понесені в результаті переходу на сайти,
              посилання на які знаходяться на цьому сайті.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Зміни</h2>
            <p className={s.text}>
              Адміністрація сайту залишає за собою право на свій власний розсуд
              в будь-який час вносити зміни та поправки, а також доповнювати або
              видаляти будь-які розділи цієї Угоди, повністю або частково.
              Зміни, внесені до Угоди, будуть дійсні після того, як повідомлення
              про ці зміни буде розміщена на Сайті. Ваше подальше використання
              Сайту після розміщення повідомлення про зміни в Угоді означає Вашу
              згоду з цими змінами. Адміністрація сайту може в будь-який час без
              попереднього повідомлення скасовувати, змінювати, виправляти
              будь-які помилки або упущення в будь-якому розділі сайту, а також
              вносити інші зміни в матеріали сайту і розміщувати на ньому
              інформацію про продукцію або цінах (якщо така є), призупиняти або
              припиняти роботу різних розділів сайту, включаючи доступ до деяких
              функцій сайту. Адміністрація сайту також може накладати обмеження
              на певні функції і послуги або обмежувати Ваш доступ до окремих
              розділів сайту або до всього сайту без повідомлення та будь-якої
              відповідальності зі свого боку.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Безпека</h2>
            <p className={s.text}>
              Ви не повинні: – використовувати будь-які пристрої або програмне
              забезпечення, яке може перешкодити роботі Сайту; – здійснювати
              будь-які дії, в результаті яких інфраструктура Сайту піддасться
              непропорційно великий і необгрунтованою навантаженні (наприклад,
              розсилка масових електронних листів – «спам»); – втручатися в
              роботу програмного забезпечення сайту, або його функціональних
              елементів, включаючи розміщення на Сайті матеріалів, заражених
              вірусами, шкідливими програмами типу «троянський кінь», «бомба
              уповільненої дії» або іншими елементами, які можуть завдати шкоди
              програмної структурі сайту або вплинути на її роботу.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Повідомлення</h2>
            <p className={s.text}>
              Всі номери «листи», «повідомлення» і інші подібні висловлювання
              відносяться до електронного способу зв’язку (наприклад, по
              електронній пошті), за умови збереження посилається на
              повідомлення стороною достовірних доказів того, що повідомлення
              було відправлено і отримано.
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Обмеження відповідальності</h2>
            <p className={s.text}>
              Адміністрація сайту ні при яких обставинах не несе
              відповідальності за будь-які прямі, непрямі, побічні, фактичні або
              випадкові збитки, або випадкові штрафні збитки (включаючи, без
              будь-яких обмежень, збиток, нанесений в зв’язку з втратою
              підприємства, які не укладенням договору, неотриманням доходу ,
              даних, інформації або перервою в продуктивної діяльності), що
              виникли в результаті або у зв’язку з використанням або
              неможливістю використання даного сайту або його змісту; або в
              зв’язку з цією угодою, навіть якщо Адміністрація
            </p>
          </li>
          <li className={s.item}>
            <h2 className={s.subTitle}>Вирішення конфліктів і суперечок</h2>
            <p className={s.text}>
              Користувач, який вважає, що його / її права і / або інтереси були
              порушені адміністрацією сайту може відправити претензію по
              електронній пошті за адресою&nbsp;
              <a href="mailto:info@uanimals.org" className={s.link}>
                info@uanimals.org
              </a>{' '}
              нa українською або російською мовою з зазначенням повного
              юридичного імені (для юридичних осіб) або ім’я, прізвище та по
              батькові (для фізичних осіб), а також зворотної адреси (поштового
              та електронного) і контактного номера телефону. Протягом 10
              робочих днів після отримання претензії адміністрація сайту
              зобов’язується відправити відповідь по суті на електронну адресу
              відправника, вказаний в листі. Адміністрація сайту не розглядає
              анонімні скарги або скарги, які не містять правдиву або повну
              інформацію про відправника. У разі, якщо відправник не задоволений
              відповіддю, отриманою від адміністрації сайту, або користувач не
              отримав його в призначений час, процедура повинна бути пройдена
              заново через поштове листування. Для цих цілей використовується
              поштова адреса&nbsp;
              <a href="mailto:info@uanimals.org" className={s.link}>
                info@uanimals.org
              </a>
              . Також, термін відповіді від компанії в письмовій формі буде
              продовжений до 10 робочих днів. У разі невирішеності спору через
              процедуру подачі претензії суперечка вирішити в суді.
            </p>
          </li>
        </ul>
      </Container>
    </section>
  );
};

export default TermsAndConditionsPage;
