export const ACTIVE_COLLECTION_LIST = [
  {
    _id: '1',
    title: 'На підтримку воїнів',
    importance: 'Терміновий збір',
    image: '',
    collected: 90000,
    target: 100000,
    alt: 'Collection 1',
    peopleDonate: 100,
    desc: ` Збираємо на енергетичні батончики, їжа швидкого приготування, вітаміни
          - все це необхідно щодня. Долучайтеся до збору, підтримаємо наших
          воїнів разом!`,
  },
  {
    _id: '2',
    title: 'На підтримку воїнів',
    importance: 'Терміновий збір',
    image: '',
    collected: 5000,
    target: 100000,
    alt: 'Collection 1',
    peopleDonate: 100,
    desc: ` Збираємо на енергетичні батончики, їжа швидкого приготування, вітаміни
          - все це необхідно щодня. Долучайтеся до збору, підтримаємо наших
          воїнів разом!`,
  },
  {
    _id: '3',
    title: 'На підтримку воїнів',
    importance: 'Терміновий збір',
    image: '',
    collected: 50000,
    target: 100000,
    alt: 'Collection 1',
    peopleDonate: 100,
    desc: ` Збираємо на енергетичні батончики, їжа швидкого приготування, вітаміни
          - все це необхідно щодня. Долучайтеся до збору, підтримаємо наших
          воїнів разом!`,
  },
  {
    _id: '4',
    title: 'На підтримку воїнів',
    importance: 'Терміновий збір',
    image: '',
    collected: 2000,
    target: 100000,
    alt: 'Collection 1',
    peopleDonate: 100,
    desc: ` Збираємо на енергетичні батончики, їжа швидкого приготування, вітаміни
          - все це необхідно щодня. Долучайтеся до збору, підтримаємо наших
          воїнів разом!`,
  },
  {
    _id: '5',
    title: 'На підтримку воїнів',
    importance: 'Терміновий збір',
    image: '',
    collected: 2000,
    target: 100000,
    alt: 'Collection 1',
    peopleDonate: 100,
    desc: ` Збираємо на енергетичні батончики, їжа швидкого приготування, вітаміни
          - все це необхідно щодня. Долучайтеся до збору, підтримаємо наших
          воїнів разом!`,
  },
  {
    _id: '6',
    title: 'На підтримку воїнів',
    importance: 'Терміновий збір',
    image: '',
    collected: 2000,
    target: 100000,
    alt: 'Collection 1',
    peopleDonate: 100,
    desc: ` Збираємо на енергетичні батончики, їжа швидкого приготування, вітаміни
          - все це необхідно щодня. Долучайтеся до збору, підтримаємо наших
          воїнів разом!`,
  },
];
