{
    "title": "Про нас",
    "description": " InHarmony — це благодійна організація, що об`єднує людей, готових створювати зміни для тих, хто цього потребує найбільше. Ми працюємо для підтримки родин військових, внутрішньо переміщених осіб та громадян, які постраждали від війни. Окрім цього, наша робота спрямована на турботу про тварин, які постраждали внаслідок війни, та потребують допомоги і захисту. Завдяки вашим внескам та довірі, ми можемо забезпечувати критично важливу підтримку там, де вона необхідна найбільше.",
    "activities": {
        "title": "Ключові напрямки діяльності:",
        "cards": [
            {
                "id": "1",
                "logo": "",
                "title": "Підтримка родин військових та ВПО",
                "description": "Ми забезпечуємо необхідною допомогою родини військових і вимушено переміщених осіб, надаючи необхідні речі, харчові продукти та психологічну підтримку."
            },
            {
                "id": "2",
                "logo": "",
                "title": "Допомога прифронтовим територіям",
                "description": "Доправляємо гуманітарну допомогу жителям сіл на лінії фронту. Забезпечуємо продукти, ліки та засоби першої необхідності, підтримуючи їх у важкий час."
            },
            {
                "id": "3",
                "logo": "",
                "title": "Підтримка тварин у кризових регіонах",
                "description": "Годуємо та евакуюємо тварин із небезпечних зон бойових дій, надаємо ветеринарну допомогу та допомагаємо знайти їм новий прихисток."
            },
            {
                "id": "4",
                "logo": "",
                "title": "Розробка модульного містечка для переселенців",
                "description": "Ми створюємо проєкт сучасного та безпечного модульного містечка для мешканців Маріуполя, що втратили свої домівки через війну."
            }
        ]
    },
    "motivation": "Долучайтеся до нашої ініціативи — разом ми можемо врятувати ще більше життів!",
    "learnMore": "Дізнатися більше"
}